app/Controllers/ArtistsController.php

SELECT *
FROM `artists`
---
    public function index()
    {
        $data = [
            'artists' => $this->artistModel->findAll(),
            'title' => 'Artists List'
        ];