app/Controllers/ArtifactsController.php

    public function index()
    {
        $artifacts = $this->artifactsModel
            ->select('artifacts.*, artists.name AS artist_name, categories.name AS category_name, users.username AS user_name, model_files.file_path AS model_file_path')
            ->join('artists', 'artists.artist_id = artifacts.artist_id', 'left')
            ->join('categories', 'categories.category_id = artifacts.category_id', 'left')
            ->join('users', 'users.user_id = artifacts.user_id', 'left')
            ->join('model_files', 'model_files.model_id = artifacts.model_id', 'left')
            ->findAll();
---
SELECT `artifacts`.*, `artists`.`name` AS `artist_name`, `categories`.`name` AS `category_name`, `users`.`username` AS `user_name`, `model_files`.`file_path` AS `model_file_path`
FROM `artifacts`
LEFT JOIN `artists` ON `artists`.`artist_id` = `artifacts`.`artist_id`
LEFT JOIN `categories` ON `categories`.`category_id` = `artifacts`.`category_id`
LEFT JOIN `users` ON `users`.`user_id` = `artifacts`.`user_id`
LEFT JOIN `model_files` ON `model_files`.`model_id` = `artifacts`.`model_id`

    public function show($artifact_id = null)
    {
        $artifact = $this->artifactsModel
            ->select('artifacts.*, artists.name AS artist_name, categories.name AS category_name, users.username AS user_name, model_files.file_path AS model_file_path')
            ->join('artists', 'artists.artist_id = artifacts.artist_id', 'left')
            ->join('categories', 'categories.category_id = artifacts.category_id', 'left')
            ->join('users', 'users.user_id = artifacts.user_id', 'left')
            ->join('model_files', 'model_files.model_id = artifacts.model_id', 'left')
            ->find($artifact_id);
---
SELECT `artifacts`.*, `artists`.`name` AS `artist_name`, `categories`.`name` AS `category_name`, `users`.`username` AS `user_name`, `model_files`.`file_path` AS `model_file_path`
FROM `artifacts`
LEFT JOIN `artists` ON `artists`.`artist_id` = `artifacts`.`artist_id`
LEFT JOIN `categories` ON `categories`.`category_id` = `artifacts`.`category_id`
LEFT JOIN `users` ON `users`.`user_id` = `artifacts`.`user_id`
LEFT JOIN `model_files` ON `model_files`.`model_id` = `artifacts`.`model_id`
WHERE `artifacts`.`artifact_id` = '10'

    public function new()
    {
        $data = [
            'title' => 'Add New Artifact',
            'artists' => $this->artistModel->findAll(),
            'categories' => $this->categoryModel->findAll(),
            'users' => $this->userModel->findAll()
---
SELECT *
FROM `artists`
SELECT *
FROM `categories`
SELECT *
FROM `users`