app/Controllers/CategoriesController.php

SELECT *
FROM `categories`
---
    public function index()
    {
        $model = new CategoryModel();
        $categories = $model->findAll();